benchmark/results_create/create-donation-c16-d10s.txt
Running 10s test @ http://localhost:5000
  8 threads and 16 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    66.64ms   31.81ms 560.30ms   94.58%
    Req/Sec    31.19     10.37   130.00     62.94%
  Latency Distribution
     50%   61.93ms
     75%   71.05ms
     90%   84.41ms
     99%  178.84ms
  2478 requests in 10.05s, 793.73KB read
Requests/sec:    246.45
Transfer/sec:     78.94KB