benchmark/results_create/create-donation-c32-d10s.txt
Running 10s test @ http://localhost:5000
  8 threads and 32 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   138.87ms  162.51ms   1.82s    95.68%
    Req/Sec    37.43     14.67   220.00     80.50%
  Latency Distribution
     50%  110.97ms
     75%  122.09ms
     90%  138.70ms
     99%    1.08s 
  2799 requests in 10.07s, 0.88MB read
Requests/sec:    278.04
Transfer/sec:     89.06KB