benchmark/results_create/create-donation-c8-d10s.txt
Running 10s test @ http://localhost:5000
  8 threads and 8 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    27.09ms   12.57ms 146.69ms   76.31%
    Req/Sec    37.60     14.21    80.00     72.56%
  Latency Distribution
     50%   25.15ms
     75%   32.19ms
     90%   41.79ms
     99%   78.95ms
  3013 requests in 10.04s, 0.94MB read
Requests/sec:    300.11
Transfer/sec:     96.13KB